# UpDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..UpDirection Property
TextNode Class See Also
---
Direction along the vertical axis of letters of the text object in model space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ UpDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UpDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ UpDirection {
	XYZ^ get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace